Autodesk.Revit.DB.MEPFamilyConnectorInfo.GetAssociateFamilyParameterId(Autodesk.Revit.DB.ElementId)
Gets the associate family parameter id of the specified connector parameter id.
connectorParameterId:
connectorParameterId is defined in the family connector element.
Returns:
Returns valid ElementId if the connectorParameterId associates to one family parameter; otherwise returns invalid ElementId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.MEPFamilyConnectorInfo.GetConnectorParameterValue(Autodesk.Revit.DB.ElementId)
Gets the parameter value of the specified connector parameter id.
connectorParameterId:
connectorParameterId is defined in the family connector element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.MEPFamilyConnectorInfo
MEP family connector information.
Since:
2017